<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)</string>
    <key>Description</key>
    <string>Downloads the latest version of Docker and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.lashomb.pkg.Docker</string>
    <key>Input</key>
    <dict>
        <key>BUNDLE_ID</key>
        <string>com.docker.docker</string>
        <key>NAME</key>
        <string>Docker</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.chilcote.download.Docker</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%NAME%.app</string>
                <key>source_path</key>
                <string>%pathname%/%NAME%.app</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>find</key>
                <string>-ce-mac</string>
                <key>input_string</key>
                <string>%version%</string>
                <key>replace</key>
                <string>.</string>
            </dict>
            <key>Processor</key>
            <string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
        </dict>
        <dict>
        <key>Arguments</key>
        <dict>
            <key>pkg_request</key>
            <dict>
                <key>chown</key>
                <array>
                    <dict>
                        <key>group</key>
                        <string>admin</string>
                        <key>path</key>
                        <string>Applications</string>
                        <key>user</key>
                        <string>root</string>
                    </dict>
                </array>
                <key>id</key>
                <string>%BUNDLE_ID%</string>
                <key>options</key>
                <string>purge_ds_store</string>
                <key>pkgname</key>
                <string>%NAME%-%output_string%</string>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>version</key>
                <string>%output_string%</string>
                <key>scripts</key>
                <string>scripts</string>
            </dict>
        </dict>
        <key>Processor</key>
        <string>PkgCreator</string>
    </dict>
    </array>
</dict>
</plist>