<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads latest version of Telegraf.</string>
        <key>Identifier</key>
        <string>com.github.lashomb.download.Telegraf</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Telegraf</string>
            <!--SELECT YOUR OS VERSION AND USE IT IN YOUR OVERRIDE
                "darwin_amd64" for macOS x86_64 DMG
                "darwin_arm64" for macOS arm64 M1 DMG
            -->
            <key>OS</key>
            <string></string>
            <key>ARCH</key>
            <string></string>
            <key>SEARCH_URL</key>
            <string>https://github.com/influxdata/telegraf/releases</string>
            <key>SEARCH_PATTERN</key>
            <string>(?P&lt;url&gt;telegraf-(?P&lt;version&gt;[0-9.]+)_%OS%\.dmg)</string>
            <key>DOWNLOAD_URL</key>
            <string>https://dl.influxdata.com/telegraf/releases</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%SEARCH_URL%</string>
                    <key>re_pattern</key>
                    <string>%SEARCH_PATTERN%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%/%match%</string>
                    <key>filename</key>
                    <string>%NAME%-%version%-%ARCH%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/Telegraf.app</string>
                    <key>strict_verification</key>
                    <false/>
                    <key>requirement</key>
                    <string>identifier "com.influxdata.telegraf" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = M7DN9H35QT</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>
